<script lang="ts" setup>
import ContentWidgetFactory from '~/components/ContentWidgets/ContentWidgetFactory'

import usePageContentBlocks from '~/composables/usePageContentBlocks'

const { widgets } = await usePageContentBlocks('/')

// const pageTitle = computed(() => page.value?.name || '')

const widgetsList = computed(() => {
    return widgets.value && Array.isArray(widgets.value) ? widgets.value : []
})

// const text = ref<ContentWidgetBase[]>([
//     {
//         id: Math.ceil(Math.random() * 1000),
//         block_type: 'brand',
//         block_size: 12,
//         data: {
//             image: '/images/pnk.svg',
//             title: 'Союзу "Палата Налоговых Консультантов" 22 года',
//             text: 'Налоговое бюро является структурным подразделением Союза "ПНК"',
//             url: '#'
//         },
//         children: []
//     },
//     {
//         id: Math.ceil(Math.random() * 1000),
//         block_type: 'text',
//         block_size: 12,
//         text: `
//             <h1>Заголовок 1 уровня</h1>
//             <p>
//                 <strong>Союз по организации <a href="/">деятельности</a> консультантов по налогам и сборам «Палата налоговых
//                 консультантов», именуемый в дальнейшем по тексту Союз «ПНК», - некоммерческая организация,
//                 созданная как объединение юридических и физических лиц, основанное на добровольном членстве и
//                 созданное для представления и защиты общих, в том числе профессиональных интересов, координации
//                 деятельности ее членов для достижения общественно – полезных и профессиональных целей.</strong>
//             </p>
//             <p>
//                 <a href="/ui/">
//                     Союз по организации деятельности консультантов по налогам и сборам «Палата налоговых
//                     консультантов», именуемый в дальнейшем по тексту Союз «ПНК», - некоммерческая организация,
//                     созданная как объединение юридических и физических лиц, основанное на добровольном членстве
//                     и созданное для представления и защиты общих, в том числе профессиональных интересов,
//                     координации деятельности ее членов для достижения общественно – полезных и
//                     профессиональных целей.
//                 </a>
//             </p>
//             <p>
//                 Союз по организации деятельности консультантов по налогам и сборам «Палата налоговых консультантов»,
//                 именуемый в дальнейшем по тексту Союз «ПНК», - некоммерческая организация, созданная как
//                 объединение юридических и физических лиц, основанное на добровольном членстве и созданное для
//                 представления и защиты общих, в том числе профессиональных интересов, координации деятельности
//                 ее членов для достижения общественно – полезных и профессиональных целей.
//             </p>
//             <p>
//                 Союз по организации деятельности консультантов по налогам и сборам «Палата налоговых консультантов»,
//                 именуемый в дальнейшем по тексту Союз «ПНК», - некоммерческая организация, созданная как
//                 объединение юридических и физических лиц, основанное на добровольном членстве и созданное для
//                 представления и защиты общих, в том числе профессиональных интересов, координации деятельности
//                 ее членов для достижения общественно – полезных и профессиональных целей.
//             </p>
//             <h2>Заголовок 2 уровня</h2>
//             <p>
//                 Союз по организации деятельности консультантов по налогам и сборам «Палата налоговых консультантов»,
//                 именуемый в дальнейшем по тексту Союз «ПНК», - некоммерческая организация, созданная как
//                 объединение юридических и физических лиц, основанное на добровольном членстве и созданное для
//                 представления и защиты общих, в том числе профессиональных интересов, координации деятельности ее
//                 членов для достижения общественно – полезных и профессиональных целей.
//             </p>
//             <h3>Заголовок 3 уровня</h3>
//             <p>
//                 Союз по организации деятельности консультантов по налогам и сборам «Палата налоговых консультантов»,
//                 именуемый в дальнейшем по тексту Союз «ПНК», - некоммерческая организация, созданная как
//                 объединение юридических и физических лиц, основанное на добровольном членстве и созданное
//                 для представления и защиты общих, в том числе профессиональных интересов, координации
//                 деятельности ее членов для достижения общественно – полезных и профессиональных целей.
//             </p>
//             <h4>Заголовок 4 уровня</h4>
//             <ol>
//                 <li>
//                     Регистрация налогоплательщиков: офисы налогового бюро занимаются регистрацией новых
//                     налогоплательщиков, включая индивидуальных предпринимателей, юридические лица и
//                     физических лиц, обязанных уплачивать налоги.
//                 </li>
//                 <li>
//                     Сбор и анализ налоговых деклараций: офисы принимают и проводят проверку налоговых
//                     деклараций, представляемых налогоплательщиками. Они обрабатывают информацию, используют
//                     автоматизированные системы для анализа деклараций и проверки
//                     достоверности предоставленных данных.
//                 </li>
//                 <li>
//                     Определение налоговых обязательств: на основе анализа деклараций и других документов,
//                     офисы налогового бюро определяют налоговые обязательства налогоплательщика. Они могут
//                     высылать уведомления о налоговых платежах и устанавливать сроки оплаты.
//                 </li>
//             </ol>
//             <h4>Заголовок 4 уровня</h4>
//             <ul>
//                 <li>
//                     Регистрация налогоплательщиков: офисы налогового бюро занимаются регистрацией новых
//                     налогоплательщиков, включая индивидуальных предпринимателей, юридические лица и физических
//                     лиц, обязанных уплачивать налоги.
//                 </li>
//                 <li>
//                     Сбор и анализ налоговых деклараций: офисы принимают и проводят проверку налоговых деклараций,
//                     представляемых налогоплательщиками. Они обрабатывают информацию, используют автоматизированные
//                     системы для анализа деклараций и проверки достоверности предоставленных данных.
//                 </li>
//                 <li>
//                     Определение налоговых обязательств: на основе анализа деклараций и других документов,
//                     офисы налогового бюро определяют налоговые обязательства налогоплательщика. Они могут
//                     высылать уведомления о налоговых платежах и устанавливать сроки оплаты.
//                 </li>
//             </ul>
//         `
//     }])

</script>
<template>
    <div class="my-15 space-y-15 md:space-y-6">
        <div class="">
            <h1 class="text-4.5xl font-semibold leading-13 md:text-4xl mb-2 md:mb-3 text-center text-black">
                Налоговое бюро
            </h1>
            <p class="text-lg text-center mb-10 md:mb-6 text-black md:text-base	font-medium">
                Палаты налоговых консультантов
            </p>
        </div>

        <div class="space-y-4">
            <ContentWidgetFactory
                :widgets="widgetsList"
            />
        </div>

        <div class="container">
            <NuxtLink class="!block" to="/services/">
                Все услуги
            </NuxtLink>
            <NuxtLink class="!block" to="/central-office/">
                Центральный офис Налогового Бюро
            </NuxtLink>
            <NuxtLink class="!block" to="/office/">
                Реестр офисов
            </NuxtLink>
            <NuxtLink class="!block" to="/tts/">
                Типовая текстовая
            </NuxtLink>
            <NuxtLink class="!block" to="/sitemap/">
                sitemap
            </NuxtLink>
        </div>
    </div>
</template>
