<script lang="ts" setup>
import ContentWidgetFactory from '~/components/ContentWidgets/ContentWidgetFactory'

import usePageContentBlocks from '~/composables/usePageContentBlocks'

const { widgets } = await usePageContentBlocks('/')

const responseData = ref<any>([
    {
        id: Math.ceil(Math.random() * 1000),
        block_type: 'text',
        block_size: 12,
        data: {
            text: `
                    <h1>Заголовок 1 уровня</h1>
                    <p>
                        <strong>Союз по организации деятельности <a href="/">консультантов</a> по налогам и сборам «Палата налоговых
                        консультантов», именуемый в дальнейшем по тексту Союз «ПНК», - некоммерческая организация,
                        созданная как объединение юридических и физических лиц, основанное на добровольном членстве и
                        созданное для представления и защиты общих, в том числе профессиональных интересов, координации
                        деятельности ее членов для достижения общественно – полезных и профессиональных целей.</strong>
                    </p>
                    <p>
                        <a href="/ui/">
                            Союз по организации деятельности консультантов по налогам и сборам «Палата налоговых
                            консультантов», именуемый в дальнейшем по тексту Союз «ПНК», - некоммерческая организация,
                            созданная как объединение юридических и физических лиц, основанное на добровольном членстве
                            и созданное для представления и защиты общих, в том числе профессиональных интересов,
                            координации деятельности ее членов для достижения общественно – полезных и
                            профессиональных целей.
                        </a>
                    </p>
                    <p>
                        Союз по организации деятельности консультантов по налогам и сборам «Палата налоговых консультантов»,
                        именуемый в дальнейшем по тексту Союз «ПНК», - некоммерческая организация, созданная как
                        объединение юридических и физических лиц, основанное на добровольном членстве и созданное для
                        представления и защиты общих, в том числе профессиональных интересов, координации деятельности
                        ее членов для достижения общественно – полезных и профессиональных целей.
                    </p>
                    <p>
                        Союз по организации деятельности консультантов по налогам и сборам «Палата налоговых консультантов»,
                        именуемый в дальнейшем по тексту Союз «ПНК», - некоммерческая организация, созданная как
                        объединение юридических и физических лиц, основанное на добровольном членстве и созданное для
                        представления и защиты общих, в том числе профессиональных интересов, координации деятельности
                        ее членов для достижения общественно – полезных и профессиональных целей.
                    </p>
                    <h2>Заголовок 2 уровня</h2>
                    <p>
                        Союз по организации деятельности консультантов по налогам и сборам «Палата налоговых консультантов»,
                        именуемый в дальнейшем по тексту Союз «ПНК», - некоммерческая организация, созданная как
                        объединение юридических и физических лиц, основанное на добровольном членстве и созданное для
                        представления и защиты общих, в том числе профессиональных интересов, координации деятельности ее
                        членов для достижения общественно – полезных и профессиональных целей.
                    </p>
                    <h3>Заголовок 3 уровня</h3>
                    <p>
                        Союз по организации деятельности консультантов по налогам и сборам «Палата налоговых консультантов»,
                        именуемый в дальнейшем по тексту Союз «ПНК», - некоммерческая организация, созданная как
                        объединение юридических и физических лиц, основанное на добровольном членстве и созданное
                        для представления и защиты общих, в том числе профессиональных интересов, координации
                        деятельности ее членов для достижения общественно – полезных и профессиональных целей.
                    </p>
                    <h4>Заголовок 4 уровня</h4>
                    <ol>
                        <li>
                            Регистрация налогоплательщиков: офисы налогового бюро занимаются регистрацией новых
                            налогоплательщиков, включая индивидуальных предпринимателей, юридические лица и
                            физических лиц, обязанных уплачивать налоги.
                             <ol>
                                <li>ol </li>
                                <li>ol</li>
                                <li>ol</li>
                            </ol>
                        </li>
                        <li>
                            Сбор и анализ налоговых деклараций: офисы принимают и проводят проверку налоговых
                            деклараций, представляемых налогоплательщиками. Они обрабатывают информацию, используют
                            автоматизированные системы для анализа деклараций и проверки
                            достоверности предоставленных данных.
                        </li>
                        <li>
                            Определение налоговых обязательств: на основе анализа деклараций и других документов,
                            офисы налогового бюро определяют налоговые обязательства налогоплательщика. Они могут
                            высылать уведомления о налоговых платежах и устанавливать сроки оплаты.
                        </li>
                    </ol>
                    <h4>Заголовок 4 уровня</h4>
                    <ul>
                        <li>
                            Регистрация налогоплательщиков: офисы налогового бюро занимаются регистрацией новых
                            налогоплательщиков, включая индивидуальных предпринимателей, юридические лица и физических
                            лиц, обязанных уплачивать налоги.
                            <ul>
                                <li>ul</li>
                                <li>ul</li>
                                <li>ul</li>
                            </ul>
                        </li>
                        <li>
                            Сбор и анализ налоговых деклараций: офисы принимают и проводят проверку налоговых деклараций,
                            представляемых налогоплательщиками. Они обрабатывают информацию, используют автоматизированные
                            системы для анализа деклараций и проверки достоверности предоставленных данных.
                        </li>
                        <li>
                            Определение налоговых обязательств: на основе анализа деклараций и других документов,
                            офисы налогового бюро определяют налоговые обязательства налогоплательщика. Они могут
                            высылать уведомления о налоговых платежах и устанавливать сроки оплаты.
                        </li>
                    </ul>
                `
        }
    },
    {
        id: Math.ceil(Math.random() * 1000),
        block_type: 'quote',
        block_size: 12,
        data: {
            title: 'Цитата',
            text: '<p>Квалификационный аттестат «Консультант по налогам и сборам», сопряженный с включением в Единый реестр аттестованных налоговых консультантов, членов Союза «ПНК», является маркером для крупнейших работодателей России.</p> <p>Принимаем заявки на организацию и проведение корпоративных мероприятий</p>'
        }
    }
])

</script>
<template>
    <div class="my-15 space-y-15 md:space-y-6">
        <div class="space-y-4">
            <ContentWidgetFactory
                :widgets="responseData"
            />
        </div>
    </div>
</template>
